#+TITLE: Building a web client and server
#+AUTHOR: Marcus Birkenkrahe & ChatGPT (pledged)
#+OPTIONS: toc:nil num:nil
#+STARTUP: overview hideblocks indent
#+properties: header-args:C :main no :includes :results output :exports both
* Forking processes

- On Unix-based systems, starting a new process is easy using the ~fork~
  function to create a child process. Each child process has its own
  memory space, and each client is handled in a separate process.

- From ~man fork(2)~: Returns a unique new process ID (PID).
  #+begin_example C
  pid_t fork(void);
  #+end_example

- Here is how it works:
  #+begin_src C :main no :includes :results output
    #include <stdio.h>  // for input/output
    #include <unistd.h> // to close sockets
    #include <errno.h>  // perror and errno

    int main(void)
    {
      pid_t pid = fork(); // create a new process

      if (pid == 0) { //
        // child process
        printf("Hello from child (PID: %d)\n", getpid());
      } else if (pid > 0) {
        // parent process
        printf("Hello from parent (PID: %d, child PID: %d)\n", getpid(), pid);
      } else {
        // fork failed
        perror("fork failed");
      }
      return 0;
    }
  #+end_src

  #+RESULTS:
  : Hello from parent (PID: 1239813, child PID: 1239814)
  : Hello from child (PID: 1239814)

- ~fork~ returns 0 in the child process, and a positive number (child's
  PID) in the parent process, and -1 if the fork fails.

- You can create a *fork bomb* if you're not careful by forking in an
  infinite loop. If you try this, you should set a process limit first
  with ~ulimit -u 100~.

- Check the current limit:
  #+begin_src bash :results output :exports both
    ulimit -u
  #+end_src

  #+RESULTS:
  : 255424

- Similar to process forking is *multithreading*: here, a new thread
  within the same process is created using ~pthread_createe(3)~. Threads
  share the same address space - more scalable for large number of
  connections.

- To learn more about this, take the Operating Systems course (CSC
  420) where we talk about process management.

